test_results/v1/report/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1862781,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.396367581589391,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 2421.0,
    "pct1ResTime" : 1665.0,
    "pct2ResTime" : 1753.0,
    "pct3ResTime" : 2001.050000000152,
    "throughput" : 6183.566973281062,
    "receivedKBytesPerSec" : 1044.6846546656482,
    "sentKBytesPerSec" : 2107.4852281983303
  },
  "HTTP Request" : {
    "transaction" : "HTTP Request",
    "sampleCount" : 1862781,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15.396367581589391,
    "medianResTime" : 10.0,
    "minResTime" : 0.0,
    "maxResTime" : 2421.0,
    "pct1ResTime" : 1665.0,
    "pct2ResTime" : 1753.0,
    "pct3ResTime" : 2001.050000000152,
    "throughput" : 6183.566973281062,
    "receivedKBytesPerSec" : 1044.6846546656482,
    "sentKBytesPerSec" : 2107.4852281983303
  }
}